tests/test_cases/performance/artillery-test.yaml
config:
    phases:
        - name: 1 VUs/sec for 10 sec
          duration: 10
          arrivalRate: 1
        # - name: Warm up, 5 VUs/sec for 30 sec.
        #   duration: 30
        #   arrivalRate: 5
        # - name: Ramp up load, 5 VUs/sec for 1 mins, up to 20 VUs
        #   duration: 60
        #   arrivalRate: 5
        #   rampTo: 20 # from 5 to 20 in 1 min
        # - name: Sustained load, 20 VUs/sec for 1.5 mins.
        #   duration: 90
        #   arrivalRate: 20
    plugins:
        ensure: {}
        expect: {}
    ensure:
        maxErrorRate: 0
        p95: 250
scenarios:
    - name: CRUD Item
      flow:
          - log: 'Current environment is set to: {{ ENV }}'
          - post:
                headers:
                    x-api-key: '{{ API_KEY }}'
                url: '/'
                json:
                    query: 'mutation createItem($input: CreateItemInput) { createItem(input: $input) {id, stuff}}'
                    variables:
                        input:
                            stuff: 'test-artillery-stuff'
                expect:
                    - statusCode: 200
                capture:
                    - json: '$.data.createItem.id'
                      as: id
          - post:
                headers:
                    x-api-key: '{{ API_KEY }}'
                url: '/'
                json:
                    query: 'query getItem($id: ID!) { getItem(id: $id) { id, stuff } }'
                    variables:
                        id: '{{ id }}'
                expect:
                    - statusCode: 200
          - post:
                headers:
                    x-api-key: '{{ API_KEY }}'
                url: '/'
                json:
                    query: 'mutation updateItem($input: UpdateItemInput!) { updateItem(input: $input) { id, stuff } }'
                    variables:
                        input:
                            id: '{{ id }}'
                            stuff: 'test-artillery-stuff-updated'
                expect:
                    - statusCode: 200
                capture:
                    - json: '$.data.updateItem.id'
                      as: id
          - post:
                headers:
                    x-api-key: '{{ API_KEY }}'
                url: '/'
                json:
                    query: 'mutation deleteItem($id: ID!) { deleteItem(id: $id) { id } }'
                    variables:
                        id: '{{ id }}'
                expect:
                    - statusCode: 200